In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(1001)
# pass any numper to seed to ensure that the same random numbers will be generated,
# everytime i will run the code and those random numbers are related to this seed

In [2]:
df1 = pd.DataFrame(randn(3,3),index=['x','y','z'], columns=['c1','c2','c3'])
df2 = pd.DataFrame(randn(3,3),index=['a','b','b'], columns=['c1','c2','c3'])

In [3]:
df1

         c1        c2        c3
x -1.086446 -0.896065 -0.306299
y -1.339934 -1.206586 -0.641727
z  1.307946  1.845460  0.829115

In [4]:
df2

         c1        c2        c3
a -0.023299 -0.208564 -0.916620
b -1.074743 -0.086143  1.175839
b -1.635092  1.228194  1.076386

**To get**:

1.column `df1['column name']`

2.row `df1.loc['row name']`

3.row by its index `df1.iloc['row index(x=0,y=1,z=2)']`

4.more one row `df1.loc[['x', 'y']]`

5.specific rows and columns `df1.loc[['x','y'],['c1','c2']]`

6.sum of 2 columns in new column `df1['c4'] = df1['c1'] + df1['c2']`

In [5]:
df1['c1']

x   -1.086446
y   -1.339934
z    1.307946
Name: c1, dtype: float64

In [6]:
df1.loc['x']

c1   -1.086446
c2   -0.896065
c3   -0.306299
Name: x, dtype: float64

In [7]:
df1.iloc[0]

c1   -1.086446
c2   -0.896065
c3   -0.306299
Name: x, dtype: float64

In [8]:
df1.loc[['x','y']]

         c1        c2        c3
x -1.086446 -0.896065 -0.306299
y -1.339934 -1.206586 -0.641727

In [9]:
df1.loc[['x','y'],['c1','c2']]

         c1        c2
x -1.086446 -0.896065
y -1.339934 -1.206586

In [10]:
df1['c4'] = df1['c1'] + df1['c2']
df1

         c1        c2        c3        c4
x -1.086446 -0.896065 -0.306299 -1.982511
y -1.339934 -1.206586 -0.641727 -2.546519
z  1.307946  1.845460  0.829115  3.153406

In [11]:
# if axis = 1 => Column
newData = df1.drop('c4', axis=1, inplace=True)
# if "inplace" parameter = True that mean 
# the change will occure in the source DataFrame not only will take a copy and change it
newData

In [12]:
df1

         c1        c2        c3
x -1.086446 -0.896065 -0.306299
y -1.339934 -1.206586 -0.641727
z  1.307946  1.845460  0.829115

In [13]:
newData

In [14]:
# if axis = 0 => Row
newData2 = df1.drop('x',axis=0 )
newData2

         c1        c2        c3
y -1.339934 -1.206586 -0.641727
z  1.307946  1.845460  0.829115